INSERT INTO `rmts`.`before_next` (`before`, `station_id`, `next`)
VALUES 
-- BTS สายสีเขียวอ่อน คูคต 169 -> เคหะ 192
(170, 169, 168),
(169, 168, 167),
(168, 167, 166),
(167, 166, 165),
(166, 165, 164),
(165, 164, 163),
(164, 163, 162),
(163, 162, 161),
(162, 161, 160),
(161, 160, 159),
(160, 159, 158),
(159, 158, 157),
(158, 157, 156),
(157, 156, 155),
(156, 155, 154),
(155, 154, 104), -- ทางแยก ห้าแยกลาดพร้าว BTS สายเขียวอ่อน -> พหลโยธิน MRT 0 สายน้ำเงิน
(155, 154, 153),
(154, 153, 103), -- ทางแยก หมอชิต BTS สายเขียวอ่อน -> สวนจตุจักร MRT 0 สายน้ำเงิน
(154, 153, 152),
(153, 152, 151),
(152, 151, 150),
(151, 150, 149),
(150, 149, 148),
(149, 148, 147),
(83, 147, 146), -- ทางแยก ARL พยาไท ->  BTS พยาไท
(148, 147, 27), -- ทางแยก BTS พยาไท -> SRT พยาไท
(148, 147, 146),
(147, 146, 145),
(146, 145, 194),  -- ทางแยก สยาม BTS 0 สายเขียวอ่อน -> สยาม BTS สาย 1 สายเขียว

-- BTS สยาม 145 -> เคหะ ฯ 192
(146, 145, 170),
(145, 170, 171),
(170, 171, 172),
(171, 172, 173),
(172, 173, 112),  -- ทางแยก อโสก BTS -> สุขุมวิท MRT สาย 1
(172, 173, 174),
(173, 174, 175),
(174, 175, 176),
(175, 176, 177),
(176, 177, 178),
(177, 178, 179),
(178, 179, 180),
(179, 180, 181),
(180, 181, 182),
(181, 182, 183),
(182, 183, 184),
(183, 184, 185),
(184, 185, 186),
(185, 186, 187),
(186, 187, 188),
(187, 188, 189),
(188, 189, 190),
(189, 190, 191),
(190, 191, 192),
(191, 192, null),

-- BTS สายสีเขียว สนามกีฬาแห่งชาติ -> บางหว้า 205
(null, 193, 194),
(145, 194, 195), -- ทางแยก สยาม BTS สาย 0 -> สยาม BTS สาย 1
(193, 194, 195),
(194, 195, 196),
(195, 196, 116), -- ทางแยก BTS ศาลาแดง ->  MRT สีลม
(195, 196, 197),
(196, 197, 198),
(197, 198, 199),
(198, 199, 200),
(199, 200, 201),
(210, 201, 202), -- ทางแยก กรุงธน BTS ทอง -> กรุงธน BTS เขียว
(200, 201, 202),
(201, 202, 203),
(202, 203, 204),
(203, 204, 205),
(204, 205, 206),
(205, 206, 124), -- ทางแยก บางหว้า BTS เขียว -> บางหว้า MRT น้ำเงิน

-- BTS สายสีทอง คลองสาน -> กรุงธนบุรี BTS สายสีทอง
(null, 208, 209),
(208, 209, 210),
(209, 210, 201); -- ทางแยก กรุงธน BTS ทอง ->  กรุงธน BTS เขียว