INSERT INTO `rmts`.`before_next` (`before`, `station_id`, `next`)
VALUES
-- MRT สีม่วง จากคลองบางไผ่ 144 -> เตาปูน 129 MRT
(null, 144, 143),
(144, 143, 142),
(143, 142, 141),
(142, 141, 140),
(141, 140, 139),
(140, 139, 138),
(139, 138, 137),
(138, 137, 136),
(137, 136, 135),
(136, 135, 134),
(135, 134, 133),
(134, 133, 132),
(133, 132, 131),
(132, 131, 130),
(7, 130, 129), -- บางซ่อน SRT -> MRT บางซ่อน
(131, 130, 129),
(130, 129, 100), -- MRT 1 เตาปูน -> เตาปูน MRT 0

-- MRT รัชดาพิเษก 106 -> ท่าพระ 91
(null, 106, 107),
(106, 107, 108),
(107, 108, 109),
(108, 109, 110),
(109, 110, 111),
(85, 111, 112), -- มักกะสัน ARL => เพชรบุรี MRT 0 สายน้ำเงิน
(30, 111, 112), -- อโสก SRT => เพชรบุรี MRT 0 สายน้ำเงิน
(110, 111, 112),
(173, 112, 113),  -- ทางแยก อโสก BTS -> สุขุมวิท MRT สาย 1
(111, 112, 113),
(112, 113, 114),
(113, 114, 115),
(114, 115, 116),
(196, 116, 117), -- ทางแยก BTS ศาลาแดง ->  MRT สีลม
(115, 116, 117),
(116, 117, 118),
(1, 118, 119) -- ทางแยก STR กรุงเทพ ->  MRT หัวลำโพง
(117, 118, 119),
(118, 119, 120),
(119, 120, 121),
(120, 121, 122),
(121, 122, 91),

-- ท่าพระ แยกไป MRT ลาดพร้าว 105
(122, 91, 92),
(91, 92, 93),
(92, 93, 94),
(93, 94, 95),
(94, 95, 96),
(95, 96, 97),
(96, 97, 98),
(97, 98, 99),
(98, 99, 100),
(129, 100, 101), -- MRT สาย 1 เตาปูน -> เตาปูน MRT สาย 0
(99, 100, 101),
(6, 101, 102), -- SRT บางซื่อ -> บางซื่อ MRT
(100, 101, 102),
(101, 102, 103),
(153, 103, 104), -- ทางแยก หมอชิต BTS สายเขียวอ่อน -> สวนจตุจักร MRT 0 สายน้ำเงิน
(102, 103, 104),
(154, 104, 105), -- ทางแยก ห้าแยกลาดพร้าว BTS สายเขียวอ่อน -> พหลโยธิน MRT 0 สายน้ำเงิน
(103, 104, 105),
(104, 105, null),

-- ท่าพระ แยกไป MRT หลักสอง 128
(122, 91, 123),
(91, 123, 124),
(206, 124, 125), -- ทางแยก บางหว้า BTS เขียว -> บางหว้า MRT น้ำเงิน
(123, 124, 125),
(124, 125, 126),
(125, 126, 127),
(126, 127, 128),
(127, 128, null);