INSERT INTO `rmts`.`before_next` (`before`, `station_id`, `next`)
VALUES 
(null, 90, 89), -- ARL สุววรณภูมิ -> พยาไท
(90, 89, 36), -- ลาดกระบัง ARL -> ลาดกระบัง SRT
(90, 89, 88),
(89, 88, 87),
(88, 87, 33), -- หัวหมาก ARL -> หัวหมาก SRT
(88, 87, 86),
(87, 86, 85),
(86, 85, 110), -- มักกะสัน ARL => เพชรบุรี MRT 0 สายน้ำเงิน
(86, 85, 30), -- มักกะสัน ARL => อโศก SRT
(86, 85, 84),
(85, 84, 83),
(84, 83, 146), -- ทางแยก ARL พยาไท -> BTS พยาไท
(84, 83, 27), -- ทางแยก ARL พยาไท -> SRT พยาไท

(null, 143, 142), -- MRT สีม่วง จากคลองบางไผ่ 143 -> เตาปูน 128 MRT
(143, 142, 141),
(142, 141, 140),
(141, 140, 139),
(140, 139, 138),
(139, 138, 137),
(138, 137, 136),
(137, 136, 135),
(136, 135, 134),
(135, 134, 133),
(134, 133, 132),
(133, 132, 131),
(132, 131, 130),
(131, 130, 129),
(7, 129, 130), -- บางซ่อน SRT -> MRT บางซ่อน
(130, 129, 128),
(129, 128, 99), -- MRT 1 เตาปูน -> เตาปูน MRT 0

(169, 168, 167),  -- BTS สายสีเขียวอ่อน คูคต -> สยาม 144
(168, 167, 166),
(167, 166, 165),
(166, 165, 164),
(165, 164, 163),
(164, 163, 162),
(163, 162, 161),
(162, 161, 160),
(161, 160, 159),
(160, 159, 158),
(159, 158, 157),
(158, 157, 156),
(157, 156, 155),
(156, 155, 154),
(155, 154, 153),
(154, 153, 103), -- ทางแยก ห้าแยกลาดพร้าว BTS สายเขียวอ่อน -> พหลโยธิน MRT 0 สายน้ำเงิน
(154, 153, 152),
(153, 152, 102), -- ทางแยก หมอชิต BTS สายเขียวอ่อน -> สวนจตุจักร MRT 0 สายน้ำเงิน
(153, 152, 151),
(152, 151, 150),
(151, 150, 149),
(150, 149, 148),
(149, 148, 147),
(148, 147, 146),
(83, 146, 145), -- ทางแยก ARL พยาไท ->  BTS พยาไท
(147, 146, 27), -- ทางแยก BTS พยาไท -> SRT พยาไท
(147, 146, 145),
(146, 145, 144),
(145, 144, 193),  -- ทางแยก สยาม BTS 0 สายเขียวอ่อน -> สยาม BTS สาย 1 สายเขียว
(145, 144, 169),
(144, 169, 170),  -- BTS สยาม 144 -> เคหะ ฯ 191
(169, 170, 171),
(170, 171, 172),
(171, 172, 173),
(171, 172, 111),  -- ทางแยก อโสก BTS -> สุขุมวิท MRT สาย 1
(172, 173, 174),
(173, 174, 175),
(174, 175, 176),
(175, 176, 177),
(176, 177, 178),
(177, 178, 179),
(178, 179, 180),
(179, 180, 181),
(180, 181, 182),
(181, 182, 183),
(182, 183, 184),
(183, 184, 185),
(184, 185, 186),
(185, 186, 187),
(186, 187, 188),
(187, 188, 189),
(188, 189, 190),
(189, 190, 191),
(190, 191, null),

(null, 192, 193), -- BTS สายสีเขียว สนามกีฬาแห่งชาติ -> บางหว้า 205
(144, 193, 194), -- ทางแยก สยาม BTS สาย 0 -> สยาม BTS สาย 1
(192, 193, 194),
(193, 194, 195),
(194, 195, 115), -- ทางแยก BTS ศาลาแดง ->  MRT สีลม
(194, 195, 196),
(195, 196, 197),
(196, 197, 198),
(197, 198, 199),
(198, 199, 200),
(206, 200, 201), -- ทางแยก กรุงธน BTS ทอง -> กรุงธน BTS เขียว
(199, 200, 201),
(200, 201, 202),
(201, 202, 203),
(202, 203, 204),
(203, 204, 205),
(204, 205, 128), -- ทางแยก บางหว้า BTS เขียว -> บางหว้า MRT น้ำเงิน

(null, 208, 207), -- BTS สายสีทอง คลองสาน -> กรุงธนบุรี BTS สายสีทอง
(208, 207, 206),
(207, 206, 200), -- ทางแยก กรุงธน BTS ทอง ->  กรุงธน BTS เขียว

(null, 105, 106),
(105, 106, 107),
(106, 107, 108),
(107, 108, 109),
(108, 109, 110),
(85, 110, 111), -- มักกะสัน ARL => เพชรบุรี MRT 0 สายน้ำเงิน
(30, 110, 111), -- อโศก SRT => เพชรบุรี MRT 0 สายน้ำเงิน
(109, 110, 111),
(172, 111, 112),  -- ทางแยก อโสก BTS -> สุขุมวิท MRT สาย 1
(110, 111, 112),
(111, 112, 113),
(112, 113, 114),
(113, 114, 115),
(195, 115, 116), -- ทางแยก BTS ศาลาแดง ->  MRT สีลม
(114, 115, 116),
(115, 116, 117),
(1, 117, 118) -- ทางแยก STR กรุงเทพ ->  MRT หัวลำโพง
(116, 117, 118),
(117, 118, 119),
(118, 119, 120),
(119, 120, 121),
(120, 121, ),